In [23]:
[i for i in range(0,10) if i%2==0]
list(filter((lambda x: x%2!=0) , (list(range(0,9)))))

[1, 3, 5, 7]

In [224]:
fi = open("text7.txt","w")
fi.write("This is one\n")
fi.close()

In [225]:
fi=open("text7.txt","a")
fi.write("This is Two")
fi.close()

In [226]:
fi=open("text7.txt","r")
fi.read()

'This is one\nThis is Two'

In [223]:
l=list(range(0,15))
l.reverse()

In [85]:
m=len(l)-1
for n in range(0,len(l)):
    l[n]=l[m]
    m=m-1
l

[14, 13, 12, 11, 10, 9, 8, 7, 8, 9, 10, 11, 12, 13, 14]

In [88]:
l.append("t")

In [143]:
u="kihtrak"
h=[]
for i in u :
    h.append(i)
h.reverse()
h

['k', 'a', 'r', 't', 'h', 'i', 'k']

In [144]:

o=[""]
for i in range(len(h)):
    k=o[0]+h[i]
    o[0]=k
o[0]

'karthik'

In [227]:
fil = open("text6.txt","r")

In [228]:
for i in fi:
    fil = open("text6.txt","w")
    fil.write(i)

In [207]:
fi.readline()

''

In [229]:
fil = open("text6.txt","r")
fil.read()

''

In [1]:
import numpy as ny
import pandas as ps 
import matplotlib.pyplot as mp

In [99]:
df=ps.read_csv(r"Downloads\titanic_dataset_modified.csv")

In [100]:
df.head(3)

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [101]:
df.drop("Unnamed: 0",axis=1)

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,$14.45,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,$14.45,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,$7.23,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,$7.23,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,$7.88,NaN,S,NaN,NaN,NaN

In [102]:
fd=df.groupby(["survived","age"])
df.fillna(0)
df["age"].isna().sum()
df["age"].fillnana(0)

AttributeError: 'Series' object has no attribute 'fillnana'

In [106]:
df["survived"].isna().sum()

0

In [104]:
fd.get_group((1, 28.0)).age.size

8

In [105]:
for i in fd.groups.keys():
    if "nan" in i :
        continue
    else:
        mp.bar(str(i),fd.get_group(i).age.size)
        mp.xticks(rotation=90)

KeyError: (0, nan)